#R version 3.4.0 (2017-04-21) -- "You Stupid Darkness"
#data.table 1.10.4

#输入：
#	quaterfinal_gy_cmp_training_traveltime.txt
#	gy_contest_traveltime_training_data_second.txt
#	gy_contest_link_traveltime_training_data.txt
#
#输出：
#	result.txt
#
#执行：
#	RScript 預測.R %输出目录% %输入目录%`


Sys.setlocale("LC_CTYPE", "chinese_taiwan")

輸出目錄 = commandArgs()[length(commandArgs()) - 1]
輸入目錄 = commandArgs()[length(commandArgs())]

library(data.table)
library(parallel)

核數 = 16

訓練表 = fread(輸入目錄 +"/quaterfinal_gy_cmp_training_traveltime.txt", col.names = c("路段標識", "日期", "時間", "通行時間"), colClasses = c("character", "character", "character", "double"))
訓練表 = rbind(訓練表, fread(輸入目錄 +"/gy_contest_traveltime_training_data_second.txt", col.names = c("路段標識", "日期", "時間", "通行時間"), colClasses = c("character", "character", "character", "double"))[日期 < "2017-04-01"])
訓練表 = rbind(訓練表, fread(輸入目錄 +"/gy_contest_link_traveltime_training_data.txt", col.names = c("路段標識", "日期", "時間", "通行時間"), colClasses = c("character", "character", "character", "double")))

訓練表$年 = as.double(substr(訓練表$日期, 1, 4))
訓練表$月 = as.double(substr(訓練表$日期, 6, 7))
訓練表$日 = as.double(substr(訓練表$日期, 9, 10))
訓練表$日序 = 訓練表$日 - 1
訓練表$日序[訓練表$月 == 6] = 訓練表$日[訓練表$月 == 6] - 31
訓練表$日序[訓練表$月 == 5] = 訓練表$日[訓練表$月 == 5] - 62
訓練表$日序[訓練表$月 == 4] = 訓練表$日[訓練表$月 == 4] - 92
訓練表$日序[訓練表$月 == 3] = 訓練表$日[訓練表$月 == 3] - 123
訓練表$日序[訓練表$年 == 2016] = 訓練表$日序[訓練表$年 == 2016] - 365
訓練表$曜日 = (訓練表$日序 + 5) %% 7 + 1
訓練表$曜日[訓練表$日序 %in% c(-31:-33, -61:-63, -88:-90)] = 8
訓練表$曜日[訓練表$日序 %in% c(-34, -91)] = 1
訓練表$時 = as.double(substr(訓練表$時間, 13, 14))
訓練表$分 = as.double(substr(訓練表$時間, 16, 17)) + 1
訓練表$分序 = 60 * 訓練表$時 + 訓練表$分
訓練表$日期 = NULL
訓練表$時間 = NULL
setorder(訓練表, 分序)
setorder(訓練表, 日序)
setorder(訓練表, 路段標識)


取得曜日權重 = function(曜日甲, 曜日乙)
{
	權重 = rep(1, length(曜日乙))
	權重[曜日甲 != 曜日乙] = 0
	權重[曜日甲 != 曜日乙 & 曜日甲 %in% 1:5 & 曜日乙 %in% 1:5] = 0.5
	權重[曜日甲 != 曜日乙 & 曜日甲 %in% 6:8 & 曜日乙 %in% 6:8] = 0.5

	權重
}

計算回歸值 = function(某向量, 權重 = rep(1, length(某向量)))
{
	權重 = 權重[!is.na(某向量)]
	if (length(權重) == 0)
		return(0)

	某向量 = 某向量[!is.na(某向量)]

	損失 = double(0)
	for (甲 in 某向量)
		損失 = c(損失, sum(abs(甲 - 某向量) / 某向量 * 權重))

	mean(某向量[損失 == min(損失)])
}

計算左係數表 = function(某訓練表, 某測試日序, 某訓練日序)
{
	某選定訓練表 = rbind(cbind(某訓練表[時 %in% 6:9], 基分序 = 360), cbind(某訓練表[時 %in% 13:16], 基分序 = 780), cbind(某訓練表[時 %in% 16:19], 基分序 = 960))
	某選定訓練表 = rbind(某選定訓練表[日序 %in% 某訓練日序], 某選定訓練表[日序 %in% 某測試日序 & 時 %in% c(6:7, 13:14, 16:17)])
	某選定測試表 = rbind(cbind(某訓練表[時 == 8 & 日序 %in% 某測試日序], 基分序 = 360), cbind(某訓練表[時 == 15 & 日序 %in% 某測試日序], 基分序 = 780), cbind(某訓練表[時 == 18 & 日序 %in% 某測試日序], 基分序 = 960))
	某選定測試表$參照 = 某選定測試表$通行時間
	某選定測試表$通行時間 = NULL

	某訓練左表 = data.table(路段標識 = rep(unique(某訓練表$路段標識), each = 3 * length(某訓練日序)), 日序 = rep(某訓練日序, each = 3), 基分序 = c(360, 780, 960))
	某訓練左表 = merge(某訓練左表, 某選定訓練表[日序 %in% 某訓練日序 & 分序 < 120 + 基分序, .(左通行時間 = 計算回歸值(通行時間, 分序 - 基分序)), .(路段標識, 日序, 基分序)], by = c("路段標識", "日序", "基分序"), all.x = T)
	某訓練左表 = merge(某訓練左表, 某訓練左表[, .(回歸左通行時間 = 計算回歸值(左通行時間)), .(路段標識, 基分序)], by = c("路段標識", "基分序"))
	某訓練左表[is.na(某訓練左表)] = 0
	某訓練左表$左通行時間[is.na(某訓練左表$左通行時間)] = 某訓練左表$回歸左通行時間[is.na(某訓練左表$左通行時間)]

	某測試左表 = data.table(路段標識 = rep(unique(某訓練表$路段標識), each = 3 * length(某測試日序)), 日序 = rep(某測試日序, each = 3), 基分序 = c(360, 780, 960))
	某測試左表 = merge(某測試左表, 某選定訓練表[日序 %in% 某測試日序 & 分序 < 120 + 基分序 , .(左通行時間 = 計算回歸值(通行時間, 分序 - 基分序)), .(路段標識, 日序, 基分序)], by = c("路段標識", "日序", "基分序"), all.x = T)
	某測試左表 = merge(某測試左表, 某訓練左表[, .(回歸左通行時間 = min(回歸左通行時間)), .(路段標識, 基分序)], by = c("路段標識", "基分序"))
	某測試左表[is.na(某測試左表)] = 0
	某測試左表$左通行時間[is.na(某測試左表$左通行時間)] = 某測試左表$回歸左通行時間[is.na(某測試左表$左通行時間)]
	某測試近左表 = 某選定訓練表[日序 %in% 某測試日序 & 分序 >= 101 + 基分序 & 分序 < 120 + 基分序, .(近左預測 = 計算回歸值(通行時間, 1 / (120 + 基分序 - 分序))), .(路段標識, 日序, 基分序)]
	某測試遠左表 = 某選定訓練表[日序 %in% 某測試日序 & 分序 >= 181 + 基分序 & 分序 < 200 + 基分序, .(遠左預測 = 計算回歸值(通行時間, 1 / (分序 - 180 - 基分序))), .(路段標識, 日序, 基分序)]

	某訓練主表 = merge(某選定訓練表, 某訓練左表, by = c("路段標識", "日序", "基分序"))

	函式甲 = function(序號甲, 某選定測試表, 某測試左表, 某測試近左表, 某測試遠左表, 某訓練主表, 某測試日序, 某訓練日序, 取得曜日權重, 計算回歸值)
	{
		library(data.table)

		甲左係數表 = NULL
		for (子 in seq(序號甲, length(unique(某訓練主表$路段標識)), 核數))
			for (基分序丑 in c(360, 780, 960))
			{
				甲路段標識 = unique(某訓練主表$路段標識)[子]

				甲測試表 = merge(某選定測試表[路段標識 == 甲路段標識 & 基分序 == 基分序丑], 某訓練主表[路段標識 == 甲路段標識 & 基分序 == 基分序丑, .(路段標識, 基分序, 某訓練日序 = 日序, 訓練曜日 = 曜日, 訓練分序 = 分序, 通行時間, 左通行時間)], by = c("路段標識", "基分序"), allow.cartesian = T)
				甲測試表 = 甲測試表[abs(分序 - 訓練分序) <= 30]
				甲測試表$權重 = 1 / (1 + abs(甲測試表$分序 - 甲測試表$訓練分序)) * 取得曜日權重(甲測試表$曜日, 甲測試表$訓練曜日)

				甲預測主表 = 甲測試表[, .(路段分最優平均通行時間比 = 計算回歸值(通行時間 / (120 + 左通行時間), 權重)), .(路段標識, 日序, 基分序, 分序)]
				甲預測主表 = merge(甲預測主表, 某測試左表[路段標識 == 甲路段標識], by = c("路段標識", "日序", "基分序"), all.x = T)
				甲預測主表 = merge(甲預測主表, 某測試近左表[路段標識 == 甲路段標識], by = c("路段標識", "日序", "基分序"), all.x = T)
				甲預測主表 = merge(甲預測主表, 某測試遠左表[路段標識 == 甲路段標識], by = c("路段標識", "日序", "基分序"), all.x = T)
				甲預測主表[is.na(甲預測主表)] = 0
				甲預測主表$主預測 = 甲預測主表$路段分最優平均通行時間比 * (120 + 甲預測主表$左通行時間)

				甲評價表 = merge(甲預測主表[, .(路段標識, 日序, 基分序, 分序, 主預測, 近左預測, 遠左預測)], 某選定測試表[路段標識 == 甲路段標識 & 基分序 == 基分序丑, .(路段標識, 日序, 分序, 參照)], by = c("路段標識", "日序", "分序"), all.y = T)
				甲評價表[is.na(甲評價表)] = 0

				if (nrow(甲評價表) == 0)
				{
					甲左係數表 = rbind(甲左係數表, data.table(路段標識 = 甲路段標識, 基分序 = 基分序丑, 近左係數 = 0, 遠左係數 = 0))
					next
				}

				最優評價 = 1
				最優近左係數 = NULL
				最優遠左係數 = NULL
				for (卯 in 0.02 * 50:0)
					for (辰 in 0.02 * 50:0)
					{
						甲評價表$近左係數 = (180 + 甲評價表$基分序 - 甲評價表$分序) * 卯 / 60
						甲評價表$近左係數[甲評價表$近左預測 == 0] = 0
						甲評價表$遠左係數 = (甲評價表$分序 - 120 - 甲評價表$基分序) * 辰 / 60
						甲評價表$遠左係數[甲評價表$遠左預測 == 0] = 0
						甲評價表$預測 = (1 - 甲評價表$近左係數 - 甲評價表$遠左係數) * 甲評價表$主預測 + 甲評價表$近左係數 * 甲評價表$近左預測 + 甲評價表$遠左係數 * 甲評價表$遠左預測

						甲評價表$評價 = abs(甲評價表$預測 - 甲評價表$參照) / 甲評價表$參照
						甲評價表$評價[甲評價表$參照 == 0] = 0

						評價 = mean(甲評價表$評價)
						if (評價 <= 最優評價)
						{
							最優評價 = 評價
							最優近左係數 = 卯
							最優遠左係數 = 辰
						}
					}

				甲左係數表 = rbind(甲左係數表, data.table(路段標識 = 甲路段標識, 基分序 = 基分序丑, 近左係數 = 最優近左係數, 遠左係數 = 最優遠左係數))
			}

		甲左係數表
	}

	集群 = makeCluster(getOption("cl.cores", 核數))
	左係數表清單 = parLapply(集群, 1:核數, 函式甲, 某選定測試表 = 某選定測試表, 某測試左表 = 某測試左表, 某測試近左表 = 某測試近左表, 某測試遠左表 = 某測試遠左表, 某訓練主表 = 某訓練主表, 某測試日序 = 某測試日序, 某訓練日序 = 某訓練日序, 取得曜日權重 = 取得曜日權重, 計算回歸值 = 計算回歸值)
	stopCluster(集群)

	左係數表 = NULL
	for (甲 in 1:核數)
		左係數表 = rbind(左係數表, 左係數表清單[[甲]])

	左係數表
}

計算左分序係數表 = function(某訓練表, 某測試日序, 某訓練日序)
{
	某選定某訓練表 = rbind(cbind(某訓練表[時 %in% 6:9], 基分序 = 360), cbind(某訓練表[時 %in% 13:16], 基分序 = 780), cbind(某訓練表[時 %in% 16:19], 基分序 = 960))
	某選定某訓練表 = rbind(某選定某訓練表[日序 %in% 某訓練日序], 某選定某訓練表[日序 %in% 某測試日序 & 時 %in% c(6:7, 13:14, 16:17)])
	某選定測試表 = rbind(cbind(某訓練表[時 == 8 & 日序 %in% 某測試日序], 基分序 = 360), cbind(某訓練表[時 == 15 & 日序 %in% 某測試日序], 基分序 = 780), cbind(某訓練表[時 == 18 & 日序 %in% 某測試日序], 基分序 = 960))
	某選定測試表$參照 = 某選定測試表$通行時間
	某選定測試表$通行時間 = NULL

	某訓練左表 = data.table(路段標識 = rep(unique(某訓練表$路段標識), each = 3 * length(某訓練日序)), 日序 = rep(某訓練日序, each = 3), 基分序 = c(360, 780, 960))
	某訓練左表 = merge(某訓練左表, 某選定某訓練表[日序 %in% 某訓練日序 & 分序 < 120 + 基分序, .(左通行時間 = 計算回歸值(通行時間, 分序 - 基分序)), .(路段標識, 日序, 基分序)], by = c("路段標識", "日序", "基分序"), all.x = T)
	某訓練左表 = merge(某訓練左表, 某訓練左表[, .(回歸左通行時間 = 計算回歸值(左通行時間)), .(路段標識, 基分序)], by = c("路段標識", "基分序"))
	某訓練左表[is.na(某訓練左表)] = 0
	某訓練左表$左通行時間[is.na(某訓練左表$左通行時間)] = 某訓練左表$回歸左通行時間[is.na(某訓練左表$左通行時間)]

	某測試左表 = data.table(路段標識 = rep(unique(某訓練表$路段標識), each = 3 * length(某測試日序)), 日序 = rep(某測試日序, each = 3), 基分序 = c(360, 780, 960))
	某測試左表 = merge(某測試左表, 某選定某訓練表[日序 %in% 某測試日序 & 分序 < 120 + 基分序 , .(左通行時間 = 計算回歸值(通行時間, 分序 - 基分序)), .(路段標識, 日序, 基分序)], by = c("路段標識", "日序", "基分序"), all.x = T)
	某測試左表 = merge(某測試左表, 某訓練左表[, .(回歸左通行時間 = min(回歸左通行時間)), .(路段標識, 基分序)], by = c("路段標識", "基分序"))
	某測試左表[is.na(某測試左表)] = 0
	某測試左表$左通行時間[is.na(某測試左表$左通行時間)] = 某測試左表$回歸左通行時間[is.na(某測試左表$左通行時間)]
	某測試近左表 = 某選定某訓練表[日序 %in% 某測試日序 & 分序 >= 101 + 基分序 & 分序 < 120 + 基分序, .(近左預測 = 計算回歸值(通行時間, 1 / (120 + 基分序 - 分序))), .(路段標識, 日序, 基分序)]
	某測試遠左表 = 某選定某訓練表[日序 %in% 某測試日序 & 分序 >= 181 + 基分序 & 分序 < 200 + 基分序, .(遠左預測 = 計算回歸值(通行時間, 1 / (分序 - 180 - 基分序))), .(路段標識, 日序, 基分序)]

	某訓練主表 = merge(某選定某訓練表, 某訓練左表, by = c("路段標識", "日序", "基分序"))

	函式甲 = function(序號甲, 某選定測試表, 某測試左表, 某測試近左表, 某測試遠左表, 某訓練主表, 某測試日序, 某訓練日序, 取得曜日權重, 計算回歸值)
	{
		library(data.table)

		甲左分序係數表 = NULL
		for (子 in seq(序號甲, length(unique(某訓練主表$路段標識)), 核數))
			for (基分序丑 in c(360, 780, 960))
			{
				甲路段標識 = unique(某訓練主表$路段標識)[子]

				甲測試表 = merge(某選定測試表[路段標識 == 甲路段標識 & 基分序 == 基分序丑], 某訓練主表[路段標識 == 甲路段標識 & 基分序 == 基分序丑, .(路段標識, 基分序, 訓練日序 = 日序, 訓練曜日 = 曜日, 訓練分序 = 分序, 通行時間, 左通行時間)], by = c("路段標識", "基分序"), allow.cartesian = T)
				甲測試表 = 甲測試表[abs(分序 - 訓練分序) <= 30]
				甲測試表$權重 = 1 / (1 + abs(甲測試表$分序 - 甲測試表$訓練分序)) * 取得曜日權重(甲測試表$曜日, 甲測試表$訓練曜日)

				甲預測主表 = 甲測試表[, .(路段分最優平均通行時間比 = 計算回歸值(通行時間 / (120 + 左通行時間), 權重)), .(路段標識, 日序, 基分序, 分序)]
				甲預測主表 = merge(甲預測主表, 某測試左表[路段標識 == 甲路段標識], by = c("路段標識", "日序", "基分序"), all.x = T)
				甲預測主表 = merge(甲預測主表, 某測試近左表[路段標識 == 甲路段標識], by = c("路段標識", "日序", "基分序"), all.x = T)
				甲預測主表 = merge(甲預測主表, 某測試遠左表[路段標識 == 甲路段標識], by = c("路段標識", "日序", "基分序"), all.x = T)
				甲預測主表[is.na(甲預測主表)] = 0
				甲預測主表$主預測 = 甲預測主表$路段分最優平均通行時間比 * (120 + 甲預測主表$左通行時間)

				甲評價表 = merge(甲預測主表[, .(路段標識, 日序, 基分序, 分序, 主預測, 近左預測, 遠左預測)], 某選定測試表[路段標識 == 甲路段標識 & 基分序 == 基分序丑, .(路段標識, 日序, 分序, 參照)], by = c("路段標識", "日序", "分序"), all.y = T)
				甲評價表[is.na(甲評價表)] = 0

				if (nrow(甲評價表) == 0)
				{
					for (寅 in seq(基分序丑 + 121, 基分序丑 + 180, 2))
					{
						甲左分序係數表 = rbind(甲左分序係數表, data.table(路段標識 = 甲路段標識, 分序 = 寅, 近左分序係數 = 0, 遠左分序係數 = 0))
					}
					next
				}

				for (寅 in seq(基分序丑 + 121, 基分序丑 + 180, 2))
				{
					最優評價 = 1
					最優近左分序係數 = NULL
					最優遠左分序係數 = NULL

					for (卯 in 0.05 * 20:0)
						for (e in 0.05 * 20:0)
						{
							甲評價表$近左係數 = 卯
							甲評價表$近左係數[甲評價表$近左預測 == 0] = 0
							甲評價表$遠左係數 = 辰
							甲評價表$遠左係數[甲評價表$遠左預測 == 0] = 0
							甲評價表$預測 = (1 - 甲評價表$近左係數 - 甲評價表$遠左係數) * 甲評價表$主預測 + 甲評價表$近左係數 * 甲評價表$近左預測 + 甲評價表$遠左係數 * 甲評價表$遠左預測

							甲評價表$評價 = abs(甲評價表$預測 - 甲評價表$參照) / 甲評價表$參照
							甲評價表$評價[甲評價表$參照 == 0] = 0
							評價 = mean(甲評價表[分序 == 寅]$評價)
							if (評價 <= 最優評價)
							{
								最優評價 = 評價
								最優近左分序係數 = 卯
								最優遠左分序係數 = 辰
							}
						}

					甲左分序係數表 = rbind(甲左分序係數表, data.table(路段標識 = 甲路段標識, 分序 = 寅, 近左分序係數 = 最優近左分序係數, 遠左分序係數 = 最優遠左分序係數))
				}
		}

		甲左分序係數表
	}

	集群 = makeCluster(getOption("cl.cores", 核數))
	左分序係數表清單 = parLapply(集群, 1:核數, 函式甲, 某選定測試表 = 某選定測試表, 某測試左表 = 某測試左表, 某測試近左表 = 某測試近左表, 某測試遠左表 = 某測試遠左表, 某訓練主表 = 某訓練主表, 某測試日序 = 某測試日序, 某訓練日序 = 某訓練日序, 取得曜日權重 = 取得曜日權重, 計算回歸值 = 計算回歸值)
	stopCluster(集群)

	左分序係數表 = NULL
	for (甲 in 1:核數)
		左分序係數表 = rbind(左分序係數表, 左分序係數表清單[[甲]])

	左分序係數表
}

預測 = function(某測試表, 某訓練表, 某左係數表, 某左分序係數表, 某測試日序, 某訓練日序)
{
	某選定某訓練表 = rbind(cbind(某訓練表[時 %in% 6:9], 基分序 = 360), cbind(某訓練表[時 %in% 13:16], 基分序 = 780), cbind(某訓練表[時 %in% 16:19], 基分序 = 960))
	某選定測試表 = rbind(cbind(某測試表[時 == 8], 基分序 = 360), cbind(某測試表[時 == 15], 基分序 = 780), cbind(某測試表[時 == 18], 基分序 = 960))

	某訓練左表 = data.table(路段標識 = rep(unique(某訓練表$路段標識), each = 3 * length(某訓練日序)), 日序 = rep(某訓練日序, each = 3), 基分序 = c(360, 780, 960))
	某訓練左表 = merge(某訓練左表, 某選定某訓練表[日序 %in% 某訓練日序 & 分序 < 120 + 基分序, .(左通行時間 = 計算回歸值(通行時間, 分序 - 基分序)), .(路段標識, 日序, 基分序)], by = c("路段標識", "日序", "基分序"), all.x = T)
	某訓練左表 = merge(某訓練左表, 某訓練左表[, .(回歸左通行時間 = 計算回歸值(左通行時間)), .(路段標識, 基分序)], by = c("路段標識", "基分序"))
	某訓練左表[is.na(某訓練左表)] = 0
	某訓練左表$左通行時間[is.na(某訓練左表$左通行時間)] = 某訓練左表$回歸左通行時間[is.na(某訓練左表$左通行時間)]

	某測試左表 = data.table(路段標識 = rep(unique(某訓練表$路段標識), each = 3 * length(某測試日序)), 日序 = rep(某測試日序, each = 3), 基分序 = c(360, 780, 960))
	某測試左表 = merge(某測試左表, 某選定某訓練表[日序 %in% 某測試日序 & 分序 < 120 + 基分序, .(左通行時間 = 計算回歸值(通行時間, 分序 - 基分序)), .(路段標識, 日序, 基分序)], by = c("路段標識", "日序", "基分序"), all.x = T)
	某測試左表 = merge(某測試左表, 某訓練左表[, .(回歸左通行時間 = min(回歸左通行時間)), .(路段標識, 基分序)], by = c("路段標識", "基分序"))
	某測試左表[is.na(某測試左表)] = 0
	某測試左表$左通行時間[is.na(某測試左表$左通行時間)] = 某測試左表$回歸左通行時間[is.na(某測試左表$左通行時間)]
	某測試近左表 = 某選定某訓練表[日序 %in% 某測試日序 & 分序 >= 101 + 基分序 & 分序 < 120 + 基分序, .(近左預測 = 計算回歸值(通行時間, 1 / (120 + 基分序 - 分序))), .(路段標識, 日序, 基分序)]
	某測試遠左表 = 某選定某訓練表[日序 %in% 某測試日序 & 分序 >= 181 + 基分序 & 分序 < 200 + 基分序, .(遠左預測 = 計算回歸值(通行時間, 1 / (分序 - 180 - 基分序))), .(路段標識, 日序, 基分序)]

	某訓練主表 = merge(某選定某訓練表, 某訓練左表, by = c("路段標識", "日序", "基分序"))

	函式甲 = function(序號甲, 某選定測試表, 某訓練主表, 某測試日序, 某訓練日序, 取得曜日權重, 計算回歸值)
	{
		library(data.table)

		甲預測主表 = NULL
		for (子 in seq(序號甲, length(unique(某訓練主表$路段標識)), 4))
		{
			甲路段標識 = unique(某訓練主表$路段標識)[子]

			甲測試表 = merge(某選定測試表[路段標識 == 甲路段標識], 某訓練主表[路段標識 == 甲路段標識, .(路段標識, 基分序, 訓練日序 = 日序, 訓練曜日 = 曜日, 訓練分序 = 分序, 通行時間, 左通行時間)], by = c("路段標識", "基分序"), allow.cartesian = T)
			甲測試表 = 甲測試表[abs(分序 - 訓練分序) <= 30]
			甲測試表$權重 = 1 / (1 + abs(甲測試表$分序 - 甲測試表$訓練分序)) * 取得曜日權重(甲測試表$曜日, 甲測試表$訓練曜日)

			甲預測主表 = rbind(甲預測主表, 甲測試表[, .(路段分最優平均通行時間比 = 計算回歸值(通行時間 / (120 + 左通行時間), 權重)), .(路段標識, 日序, 基分序, 分序)])
		}
		甲預測主表
	}

	集群 = makeCluster(getOption("cl.cores", 核數))
	某主預測表清單 = parLapply(集群, 1:核數, 函式甲, 某選定測試表 = 某選定測試表, 某訓練主表 = 某訓練主表, 某測試日序 = 某測試日序, 某訓練日序 = 某訓練日序, 取得曜日權重 = 取得曜日權重, 計算回歸值 = 計算回歸值)
	stopCluster(集群)

	某主預測表 = NULL
	for (甲 in 1:核數)
		某主預測表 = rbind(某主預測表, 某主預測表清單[[甲]])

	某預測表 = merge(某測試表, 某主預測表, by = c("路段標識", "日序", "分序"), all.x = T)
	某預測表 = merge(某預測表, 某測試左表, by = c("路段標識", "日序", "基分序"), all.x = T)
	某預測表 = merge(某預測表, 某測試近左表, by = c("路段標識", "日序", "基分序"), all.x = T)
	某預測表 = merge(某預測表, 某測試遠左表, by = c("路段標識", "日序", "基分序"), all.x = T)
	某預測表 = merge(某預測表, 某左係數表, by = c("路段標識", "基分序"), all.x = T)
	某預測表 = merge(某預測表, 某左分序係數表, by = c("路段標識", "分序"), all.x = T)
	某預測表[is.na(某預測表)] = 0
	某預測表$主預測 = 某預測表$路段分最優平均通行時間比 * (120 + 某預測表$左通行時間)
	某預測表$近左係數 = 0.7 * (180 + 某預測表$基分序 - 某預測表$分序) * (0.06 + 0.7 * 某預測表$近左係數) / 60 + 0.3 * 某預測表$近左係數_in_分序
	某預測表$近左係數[某預測表$近左預測 == 0] = 0
	某預測表$遠左係數 = 0.7 * (某預測表$分序 - 120 - 某預測表$基分序) * (0.06 + 0.7 * 某預測表$遠左係數) / 60 + 0.3 * 某預測表$遠左係數_in_分序
	某預測表$遠左係數[某預測表$遠左預測 == 0] = 0
	某預測表$Prediction = (1 - 某預測表$近左係數 - 某預測表$遠左係數) * 某預測表$主預測 + 某預測表$近左係數 * 某預測表$近左預測 + 某預測表$遠左係數 * 某預測表$遠左預測

	setorder(某預測表, 分序)
	setorder(某預測表, 日序)
	setorder(某預測表, 路段標識)
	某預測表$預測
}

左係數表 = 計算左係數表(訓練表, -61:-1, -122:-62)
左分序係數表 = 計算左分序係數表(訓練表, -61:-1, -122:-62)


預測表 = data.table(路段標識 = rep(unique(訓練表$路段標識), each = 2790), Month = 7, 日序 = rep(0:30, each = 90), 曜日 = rep((0:30 + 5) %% 7 + 1, each = 90), 時 = rep(c(8, 15, 18), each = 30), 分 = rep(1 + 0:29 * 2, 3), 分序 = rep(c(481, 901, 1081), each = 30) + 0:29 * 2)
setorder(預測表, 分序)
setorder(預測表, 日序)
setorder(預測表, 路段標識)
預測表$預測 = 預測(預測表, 訓練表, 左係數表, 左分序係數表, 0:30, c(-91:-1))

write.table(預測表[, .(路段標識 = 路段標識, 日期 = sprintf("2017-07-%02d", 日序 + 1), 時間 = sprintf("[2017-07-%02d %02d:%02d:00,2017-07-%02d %02d:%02d:00)", 日序 + 1, 時, 分 - 1, 日序 + 1, 時 + (分 + 1) %/% 60, (分 + 1) %% 60), 通行時間 = 預測)], 輸出目錄 + "/result.txt", row.names = F, quote = F, sep = "#")
